In [1]:
import sqlite3
import pandas as pd

### Setting up the connection

In [2]:
db = sqlite3.connect("c2_database.sqlite")

In [3]:
def run_query(query):
    return pd.read_sql_query(query, db)

### 1. What was the duration of the longest trip?

In [4]:
query1 = """
SELECT duration FROM trip
ORDER BY duration DESC
LIMIT 1;
"""
run_query(query1)

   duration
0    722236

### 2.  How many trips were ended at the station '2nd at South Park '?

In [5]:
query2 = """
SELECT COUNT(*) FROM trip
WHERE end_station_name='2nd at South Park';
"""
run_query(query2)

   COUNT(*)
0      2150

### 3.  How many trips had a duration between 1000 and 2000?

In [6]:
query3 = """
SELECT COUNT(*) FROM trip
WHERE duration BETWEEN 1000 AND 2000;
"""
run_query(query3)

   COUNT(*)
0      7225

### 4.  Which bike was used for the most trips?

In [7]:
query4 = """
SELECT bike_id AS 'Bike', COUNT(*) AS 'Number of Trips' FROM trip
GROUP BY bike_id
ORDER BY COUNT(*) DESC
LIMIT 1;
"""
run_query(query4)

   Bike  Number of Trips
0   392              277

### 5. Which are the top five stations for the number of round trips?

In [8]:
query5 = """
SELECT start_station_name AS 'Station', COUNT(*) as 'Number of round trips' FROM trip
WHERE start_station_name = end_station_name
GROUP BY start_station_name
ORDER BY COUNT(*) DESC
LIMIT 5;
"""
run_query(query5)

                                Station  Number of round trips
0                Embarcadero at Sansome                    255
1  Harry Bridges Plaza (Ferry Building)                    216
2                University and Emerson                    117
3                         Market at 4th                     92
4                       2nd at Townsend                     82